adonisjs/loadtest.yml
config:
  target: "http://localhost:3333"  # Replace this with your server's URL
  phases:
    - duration: 60
      arrivalRate: 20  # Number of virtual users per second during the ramp-up phase
      name: "Ramp up phase"
scenarios:
  - flow:
      - get:
          url: "/external-service"  # Replace this with the endpoint you want to load test